"""
РЕШЕНИЕ ЗАДАЧИ О КАСТРЮЛЯХ (ЗАДАЧА 1)
"""
import math

#модель dT/dt = -k(T - T_env)
#аналитическое решение: T(t) = T_env + (T0 - T_env) * exp(-k * t)

# этап идентификации параметров модели
V_1 = 4 # литра
m_1 = 4 # кг
c_1 = 4200 # Дж/(кг*К)
T_0_first = 90 # начальная температура воды в первом сосуде
T_env_first = 25 # температура окружающей среды в первом сосуде
t_1 = 40 # (мин) время охлаждения в первом сосуде
T_end_first = 50 # температура воды в первом сосуде после охлаждения

k_1 = None
k_2 = None

def calculate_k_1(T_end_first, T_env_first, t_1, T_0_first):
    """
    Функция для расчета коэффициента теплоотдачи k_1 на основе данных"""
    global k_1
    # T_end_first = T_env_first + (T_0_first - T_env_first)*exp^(-k_1*t_1)    
    # => 50 = 25 + (90 - 25)*exp^(-k_1*40)
    # => 25 = 65*exp^(-k_1*40)
    # => 25/65 = exp^(-k_1*40)
    # => ln(25/65) = -k_1*40
    # =>
    k_1 = -math.log(25/65) / 40
    return k_1

# уравнение теплового обмена: dT/dt = -k(T - T_env) => mc*dT_dt = -h*S(T - T_env)
# => k_i = h_i*S / mc = > k_2/k_1 = (h_1*S_1)/m_1*c_1 * (m_2*c_2)/(h_2*S_2)
# => k_2/k_1 = (S_2 * m_1 * c_1) / (m_2 * c_2 * S_1) - итоговая формула для расчета k_2 через k_1

# геометрия (нахождение отношения площадей через объемы и высоты сосудов)
# D = h
# S = S_боковая + S_крышка 
# S_боковая = Pi*D*h  = Pi*D^2 ~ D^2
# S_крышка = Pi*(D^2/4) ~ D^2
# S = Pi*D*h + Pi*(D^2/4) = Pi*D^2 + Pi*()D^2/4 ~ D^2
# при этом V = Pi*R^2*h = Pi*(D^2/4)*h = (Pi* D^3)/4 ~ D^3

# тогда получим, что S ~ D^2 and V ~ D^3 => V^(1/3) = D => 
# => S ~ V^(2/3)

# Тогда отношение площадей S_2/S_1 = (V_2/V_1)^(2/3)

# ПАРАМЕТРЫ ВТОРОЙ КАСТРЮЛИ:
V_2 = 3 # литра
m_2 = 2 # кг
c_2 = 3800 # Дж/(кг*К)
T_env_second = 20 # температура окружающей среды во втором сосуде
T_0_second = 80 # начальная температура воды во втором сосуде
T_end_second = 30 # температура воды во втором сосуде после охлаждения

def calculate_k_2(V_1, V_2, m_1, c_1, m_2, c_2, k_1):
    global k_2
    S_relationship = (V_2 / V_1) ** (2 / 3)
    m_relationship = m_1/m_2 
    c_relationship = c_1/c_2

    k_2 = k_1 *(S_relationship * m_relationship * c_relationship)

    return k_2    

# РЕШЕНИЕ ПРЯМОЙ ЗАДАЧИ (расчет температуры во втором сосуде в зависимости от времени)

def calculTempSecondPot(T_0_second, T_env_second, k_2):
    # аналитическое решение уравнения теплового обмена: T(t) = T_env + (T0 - T_env) * exp(-k * t)
    # 30 = 20 + (80 - 20)*exp(-k2*t2) => 10 = 60*exp(-k2*t2)
    # => t2 = -ln(1/6)/k2

    t2 = -math.log(1/6)/k_2

    return t2

def main():
    calculate_k_1(T_end_first, T_env_first, t_1, T_0_first)
    
    calculate_k_2(V_1, V_2, m_1, c_1, m_2, c_2, k_1)

    t_2 = calculTempSecondPot(T_0_second, T_env_second, k_2)
    print(f"Время охлаждения второй кастрюли до {T_end_second}°C: {t_2} минут или {t_2 * 60} секунд")

    print(f"k_1 = {k_1}\nk_2 = {k_2}")

main()
